{
  "userAlreadyInQueue": "You have already joined an event.",
  "authorizationHeaderIncorrect": "Authorization error.",
  "authorizationTokenIncorrect": "Authorization error.",
  "unknown": "An unknown error occurred on our servers.",
  "noPlayableLocationTypesMatchingSport": "Since you prefered certain location types (e.g. park, etc.), there are no playable locations matching these requirements within your specified radius.",
  "noFacilitySurfacesMatchingSport": "Since you prefered certain surfaces (e.g. pavement, rubber, etc.), there are no facilities matching these requirements within your specified radius.",
  "goodForUntilCannotBeNull": "You did not select a specific time to join the quickmatch queue.",
  "emailOrPhoneNotVerified": "Please verify at least one the following: your phone, or your email.  Check either one or both of those (recommended).",
  "serverError": "A known error has occurred and a fix is on its way.",
  "noFacilitiesAvailableForBooking": "No facilities were available or nearby in order to book an event.",
  "eidDoesNotExist": "The event that you selected no longer exists or it is no longer available.",
  "locationTooFarAway": "The location is too far away.",
  "placeIdOrFacilityIdMissing": "You did not select a specific place or facility, which you must do first.",
  "sportPositionsNotFound": "No sport positions are currently approved to make this sport available to play, currently.  Rest assured, it will be available soon.",
  "roleOrPositionCouldNotBeSet": "The specific position you wanted could not be assigned to you.  We're sorry.  Typically, this means your subscription needs to be renewed, or it means all players assigned to the positions are of the highest subscritpion tier.  ",
  "noSpaceToJoin": "Currently, no positions are available at this event.  You could try again later.",
  "userCriteriaForSportPositionUnmet": "All of your selected position(s) could not be assigned to you.  Consider selected different positions, or relaxing preferences to flexible.",
  "couldNotPersistEventAndTeamMemberAndTeam": "At this time, the team, your membership to it, and association to the event could not be established.  Please try again later.",
  "uidNotAssociatedWithEventId": "You are not a part of this event.",
  "sportIdAndRulesIdDoNotMatch": "The sport-rule set you selected is not part of the sport you had selected.",
  "userIsNotWithinGpsFence": "You are still not within the GPS fence.  Please move closer to it.",
  "teamsMaxReached": "There are too many teams which are a part of the event, already.  Consider joining a team, instead.",
  "teamNoLongerExists": "The team you had selected no longer exists.",
  "eventUserMemberCannotBeReplaced": "The event member who you attempted to take over (in terms of position) could not be replaced, because his or her tier membership is at yours or is higher.",
  "eventIsAborted": "The event you selected has been cancelled.",
  "eventIsEnded": "The event you selected has already ended.",
  "eventIsStarted": "The event you selected has already started.",
  "userDoesNotHaveHighEnoughAthleticTier":"Some preferences are not permitted, since your athletic tier is too low.",
  "userHasConflictWithExistingEvent": "You cannot schedule or join an event at this time, because the event's start and ending times overlap a different event you have already joined.",
  "eventIsNotJoinable": "The selected event is not currently joinable, at this time.",
  "eventIdDoesNotMatchWithEventUserMemberUid": "While trying to remove yourself from an event, we found that you are not even part of the event.",
  "noSportPositionLayoutSet": "The sport-rule set you selected is not currently configured properly, and rest assured, a fix is on its way.",
  "incorrectUsernamePasswordCombination": "The username and/or password you entered does not match any that is in the system.",
  "customerHasTwoOrMoreActiveSubscriptions": "Currently, you have already subscribed to a tier.  Please cancel your subscription first before changing it.",
  "stripeServiceUnavailable": "A third-party service, Stripe, does not have a working server (its service is temporarily down).",
  "stripeServiceUnavailableAndAccountTooRecent": "A third-party service, Stripe, does not have a working server (its service is temporarily down).  Also, your account is too new.",
  "goodForUntilIsBeforeAcceptable": "The time you have selected is before the allowed time to join an event.",
  "userNotInQueue": "You are currently not in a quickmatch queue.",
  "priorityPrefencesShouldNotBeSpecifiedWhenBronze": "Since you are at bronze tier (free version), some permissions are not allowed.  Please upgrade your tier membership to either Silver or Gold on our website https://www.pickupfit.com/ ",
  "exactStartTimeShouldHappenLater": "The time you have selected is in conflict with the facilities' black out dates, events, or is too soon.  Please select a different time."
}